; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	infrared2 - mode
	image0 - mode
	infrared3 - mode
	image1 - mode
	GroundStation2 - direction
	GroundStation1 - direction
	Star0 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Planet22 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet18)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image0)
	(supports instrument3 infrared2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet15)
	(supports instrument7 infrared2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon4)
	(supports instrument8 image1)
	(supports instrument8 infrared3)
	(supports instrument8 image0)
	(calibration_target instrument8 Star0)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite2 Phenomenon20)
	(pointing satellite4 Phenomenon8)
	(have_image Phenomenon3 infrared3)
	(have_image Planet5 image1)
	(have_image Planet6 image0)
	(have_image Phenomenon7 image1)
	(have_image Phenomenon8 infrared2)
	(have_image Star9 infrared3)
	(have_image Star10 image0)
	(have_image Phenomenon11 infrared2)
	(have_image Planet12 infrared3)
	(have_image Planet13 image0)
	(have_image Planet14 image0)
	(have_image Planet15 infrared2)
	(have_image Star16 image1)
	(have_image Phenomenon17 infrared3)
	(have_image Planet19 image1)
	(have_image Phenomenon20 infrared2)
	(have_image Planet21 image1)
	(have_image Planet22 infrared3)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 20
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 20
3. (turn_to satellite4 phenomenon17 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon17)
   goals met: 0 of 20
4. (turn_to satellite4 star0 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 star0)
   goals met: 0 of 20
5. (calibrate satellite4 instrument8 star0)
   added: (calibrated instrument8)
   goals met: 0 of 20
6. (turn_to satellite4 phenomenon17 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon17)
   goals met: 0 of 20
7. (take_image satellite4 phenomenon17 instrument8 infrared3)
   added: (have_image phenomenon17 infrared3)
   goals met: 1 of 20
8. (turn_to satellite4 phenomenon3 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon3)
   goals met: 1 of 20
9. (take_image satellite4 phenomenon3 instrument8 infrared3)
   added: (have_image phenomenon3 infrared3)
   goals met: 2 of 20
10. (turn_to satellite4 phenomenon7 phenomenon3)
   deleted: (pointing satellite4 phenomenon3)
   added: (pointing satellite4 phenomenon7)
   goals met: 2 of 20
11. (take_image satellite4 phenomenon7 instrument8 image1)
   added: (have_image phenomenon7 image1)
   goals met: 3 of 20
12. (turn_to satellite4 phenomenon8 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon8)
   goals met: 4 of 20
13. (turn_to satellite2 groundstation2 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 groundstation2)
   goals met: 4 of 20
14. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 4 of 20
15. (turn_to satellite2 phenomenon11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon11)
   goals met: 4 of 20
16. (take_image satellite2 phenomenon11 instrument4 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 5 of 20
17. (turn_to satellite2 phenomenon20 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon20)
   goals met: 6 of 20
18. (take_image satellite2 phenomenon20 instrument4 infrared2)
   added: (have_image phenomenon20 infrared2)
   goals met: 7 of 20
19. (turn_to satellite4 planet12 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet12)
   goals met: 6 of 20
20. (take_image satellite4 planet12 instrument8 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 7 of 20
21. (turn_to satellite4 phenomenon8 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 phenomenon8)
   goals met: 8 of 20
22. (turn_to satellite4 planet13 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet13)
   goals met: 7 of 20
23. (take_image satellite4 planet13 instrument8 image0)
   added: (have_image planet13 image0)
   goals met: 8 of 20
24. (turn_to satellite4 phenomenon8 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 phenomenon8)
   goals met: 9 of 20
25. (turn_to satellite4 planet14 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet14)
   goals met: 8 of 20
26. (take_image satellite4 planet14 instrument8 image0)
   added: (have_image planet14 image0)
   goals met: 9 of 20
27. (turn_to satellite4 phenomenon8 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 phenomenon8)
   goals met: 10 of 20
28. (turn_to satellite4 planet19 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet19)
   goals met: 9 of 20
29. (take_image satellite4 planet19 instrument8 image1)
   added: (have_image planet19 image1)
   goals met: 10 of 20
30. (turn_to satellite4 phenomenon8 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 phenomenon8)
   goals met: 11 of 20
31. (turn_to satellite4 planet21 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet21)
   goals met: 10 of 20
32. (take_image satellite4 planet21 instrument8 image1)
   added: (have_image planet21 image1)
   goals met: 11 of 20
33. (turn_to satellite4 phenomenon8 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 phenomenon8)
   goals met: 12 of 20
34. (turn_to satellite4 planet22 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet22)
   goals met: 11 of 20
35. (take_image satellite4 planet22 instrument8 infrared3)
   added: (have_image planet22 infrared3)
   goals met: 12 of 20
36. (turn_to satellite4 phenomenon8 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 phenomenon8)
   goals met: 13 of 20
37. (turn_to satellite4 planet5 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet5)
   goals met: 12 of 20
38. (take_image satellite4 planet5 instrument8 image1)
   added: (have_image planet5 image1)
   goals met: 13 of 20
39. (turn_to satellite4 phenomenon8 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 phenomenon8)
   goals met: 14 of 20
40. (turn_to satellite4 planet6 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet6)
   goals met: 13 of 20
41. (take_image satellite4 planet6 instrument8 image0)
   added: (have_image planet6 image0)
   goals met: 14 of 20
42. (turn_to satellite4 phenomenon8 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 phenomenon8)
   goals met: 15 of 20
43. (turn_to satellite4 star10 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 star10)
   goals met: 14 of 20
44. (take_image satellite4 star10 instrument8 image0)
   added: (have_image star10 image0)
   goals met: 15 of 20
45. (turn_to satellite4 phenomenon8 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 phenomenon8)
   goals met: 16 of 20
46. (turn_to satellite4 star16 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 star16)
   goals met: 15 of 20
47. (take_image satellite4 star16 instrument8 image1)
   added: (have_image star16 image1)
   goals met: 16 of 20
48. (turn_to satellite4 phenomenon8 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 phenomenon8)
   goals met: 17 of 20
49. (turn_to satellite4 star9 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 star9)
   goals met: 16 of 20
50. (take_image satellite4 star9 instrument8 infrared3)
   added: (have_image star9 infrared3)
   goals met: 17 of 20
51. (turn_to satellite4 phenomenon8 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 phenomenon8)
   goals met: 18 of 20
52. (turn_to satellite2 phenomenon8 phenomenon20)
   deleted: (pointing satellite2 phenomenon20)
   added: (pointing satellite2 phenomenon8)
   goals met: 17 of 20
53. (take_image satellite2 phenomenon8 instrument4 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 18 of 20
54. (turn_to satellite2 phenomenon20 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon20)
   goals met: 19 of 20
55. (turn_to satellite2 planet15 phenomenon20)
   deleted: (pointing satellite2 phenomenon20)
   added: (pointing satellite2 planet15)
   goals met: 18 of 20
56. (take_image satellite2 planet15 instrument4 infrared2)
   added: (have_image planet15 infrared2)
   goals met: 19 of 20
57. (turn_to satellite2 phenomenon20 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 phenomenon20)
   goals met: 20 of 20
